profit = input("请输入这一年的利润：（万元）>")
a = int(profit)
if(a <= 10):
    print("年终奖为%d:",a*0.1)
elif(a>=10 and a<20):
    print("年终奖为%d:",a*0.1+(a-10)*0.075)
elif(a>=20 and a<40):
    print("年终奖为%d:",a*0.1+(a-10)*0.075+(a-20)*0.05)
elif(a>=40 and a<60):
    print("年终奖为%d:",a*0.1+(a-10)*0.075+(a-20)*0.05+(a-40)*0.03)
elif(a>=60 and a<100):
    print("年终奖为%d:",a*0.1+(a-10)*0.075+(a-20)*0.05+(a-40)*0.03+(a-60)*0.015)
else:
    print("年终奖为%d:",a*0.1+(a-10)*0.075+(a-20)*0.05+(a-40)*0.03+(a-60)*0.015+(a-100)*0.01)
